#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.forager_token: Refreshing state... [id=none]
random_password.password: Refreshing state... [id=none]
heroku_app.api: Refreshing state... [id=adtest-recipe-app-api]
heroku_app.forager: Refreshing state... [id=adtest-recipe-app-forager]
heroku_addon.database: Refreshing state... [id=55f3abdf-e979-4c95-b7ec-e13b999a49ba]
heroku_formation.api: Refreshing state... [id=4eed8fca-5954-455e-a770-5554e7e2664e]
heroku_build.api: Refreshing state... [id=ef59cf17-31a3-4d66-854c-c4d606a938ac]
heroku_addon.mq: Refreshing state... [id=2eef135d-a0b8-4a45-997a-e05148316956]
heroku_build.forager: Refreshing state... [id=5a206de5-409e-4f95-9316-a5c67b5547c6]
heroku_addon_attachment.mq: Refreshing state... [id=ff8a3a0b-aca0-4d4d-aebf-1d2b11344c62]
heroku_formation.forager: Refreshing state... [id=f5091a03-58b4-4017-8885-a876eb934b0f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # heroku_addon.database has changed
  ~ resource "heroku_addon" "database" {
        id          = "55f3abdf-e979-4c95-b7ec-e13b999a49ba"
        name        = "postgresql-infinite-60205"
      ~ provider_id = "24167345" -> "resource54030519@heroku.com"
        # (3 unchanged attributes hidden)
    }

  # heroku_app.api has changed
  ~ resource "heroku_app" "api" {
      ~ all_config_vars       = (sensitive value)
        id                    = "adtest-recipe-app-api"
        name                  = "adtest-recipe-app-api"
        # (11 unchanged attributes hidden)
    }

  # heroku_build.api has changed
  ~ resource "heroku_build" "api" {
        id                = "ef59cf17-31a3-4d66-854c-c4d606a938ac"
      ~ output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/ef/ef59cf17-31a3-4d66-854c-c4d606a938ac.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210820%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210820T085117Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=3c7ee728276f0fa6b45d45b0964bb7b58c1dbd04e9647169a7b4d58e290c80ef" -> "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/ef/ef59cf17-31a3-4d66-854c-c4d606a938ac.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220209%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220209T105852Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=23a3daa3ee8b0dada0e76d2ccef759b867c7c61d632c8b5f4a6f0605ad835f2b"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # heroku_build.forager has changed
  ~ resource "heroku_build" "forager" {
        id                = "5a206de5-409e-4f95-9316-a5c67b5547c6"
      ~ output_stream_url = "https://build-output.heroku.com/streams/92/9254653a-38b5-4a6e-9193-6ea0303f8fce/logs/5a/5a206de5-409e-4f95-9316-a5c67b5547c6.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210820%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210820T084939Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=d9a4e07abe4f79bd37088fab4ceae4ebb14997bdeb443af5eb2611a94aa2cea0" -> "https://build-output.heroku.com/streams/92/9254653a-38b5-4a6e-9193-6ea0303f8fce/logs/5a/5a206de5-409e-4f95-9316-a5c67b5547c6.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220209%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220209T105852Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=b4d02e4a4cd91f9bb0e5ac2777519ad8aeedca3020dea0649d83fe3c05e4e8e6"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # heroku_addon.database will be destroyed
  # (because heroku_addon.database is not in configuration)
  - resource "heroku_addon" "database" {
      - app         = "adtest-recipe-app-api" -> null
      - config_vars = [
          - "DATABASE_URL",
        ] -> null
      - id          = "55f3abdf-e979-4c95-b7ec-e13b999a49ba" -> null
      - name        = "postgresql-infinite-60205" -> null
      - plan        = "heroku-postgresql:hobby-dev" -> null
      - provider_id = "resource54030519@heroku.com" -> null
    }

  # heroku_addon.mq must be replaced
-/+ resource "heroku_addon" "mq" {
      ~ app         = "adtest-recipe-app-api" -> "adtest-recipe-app-recipe-one" # forces replacement
      ~ config_vars = [
          - "CLOUDAMQP_APIKEY",
          - "CLOUDAMQP_URL",
        ] -> (known after apply)
      ~ id          = "2eef135d-a0b8-4a45-997a-e05148316956" -> (known after apply)
      ~ name        = "cloudamqp-vertical-46512" -> (known after apply)
      ~ provider_id = "92ca2f15-857a-49e4-b17e-2014d8f10236" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # heroku_addon.recipe_one_db will be created
  + resource "heroku_addon" "recipe_one_db" {
      + app         = "adtest-recipe-app-recipe-one"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

  # heroku_addon.recipe_two_db will be created
  + resource "heroku_addon" "recipe_two_db" {
      + app         = "adtest-recipe-app-recipe-two"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

  # heroku_addon.user_db will be created
  + resource "heroku_addon" "user_db" {
      + app         = "adtest-recipe-app-user"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "heroku-postgresql:hobby-dev"
      + provider_id = (known after apply)
    }

  # heroku_addon_attachment.mq must be replaced
-/+ resource "heroku_addon_attachment" "mq" {
      ~ addon_id  = "2eef135d-a0b8-4a45-997a-e05148316956" -> (known after apply) # forces replacement
      ~ id        = "ff8a3a0b-aca0-4d4d-aebf-1d2b11344c62" -> (known after apply)
      ~ name      = "CLOUDAMQP" -> (known after apply)
      + namespace = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # heroku_addon_attachment.mq_recipe_two will be created
  + resource "heroku_addon_attachment" "mq_recipe_two" {
      + addon_id  = (known after apply)
      + app_id    = (known after apply)
      + id        = (known after apply)
      + name      = (known after apply)
      + namespace = (known after apply)
    }

  # heroku_app.api will be destroyed
  # (because heroku_app.api is not in configuration)
  - resource "heroku_app" "api" {
      - acm                   = false -> null
      - all_config_vars       = (sensitive value)
      - buildpacks            = [
          - "https://github.com/heroku/heroku-buildpack-go.git",
        ] -> null
      - config_vars           = {
          - "APP_IN_QUEUE"  = "ingredients_results"
          - "APP_OUT_QUEUE" = "ingredients_lookup"
          - "GIN_MODE"      = "release"
        } -> null
      - git_url               = "https://git.heroku.com/adtest-recipe-app-api.git" -> null
      - heroku_hostname       = "adtest-recipe-app-api.herokuapp.com" -> null
      - id                    = "adtest-recipe-app-api" -> null
      - internal_routing      = false -> null
      - name                  = "adtest-recipe-app-api" -> null
      - region                = "eu" -> null
      - sensitive_config_vars = (sensitive value)
      - stack                 = "heroku-20" -> null
      - uuid                  = "f4355849-909b-42b9-833f-ef8260379e4f" -> null
      - web_url               = "https://adtest-recipe-app-api.herokuapp.com/" -> null
    }

  # heroku_app.gateway will be created
  + resource "heroku_app" "gateway" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "adtest-recipe-app-gateway"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app.recipe_one will be created
  + resource "heroku_app" "recipe_one" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "APP_IN_QUEUE"  = "ingredients_results"
          + "APP_OUT_QUEUE" = "ingredients_lookup"
          + "GIN_MODE"      = "release"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "adtest-recipe-app-recipe-one"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app.recipe_two will be created
  + resource "heroku_app" "recipe_two" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = {
          + "APP_IN_QUEUE"  = "ingredients_results"
          + "APP_OUT_QUEUE" = "ingredients_lookup"
          + "GIN_MODE"      = "release"
        }
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "adtest-recipe-app-recipe-two"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app.user will be created
  + resource "heroku_app" "user" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = "adtest-recipe-app-user"
      + region                = "eu"
      + sensitive_config_vars = (sensitive value)
      + stack                 = (known after apply)
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_build.api will be destroyed
  # (because heroku_build.api is not in configuration)
  - resource "heroku_build" "api" {
      - app               = "adtest-recipe-app-api" -> null
      - buildpacks        = [
          - "https://github.com/heroku/heroku-buildpack-go.git",
        ] -> null
      - id                = "ef59cf17-31a3-4d66-854c-c4d606a938ac" -> null
      - local_checksum    = "SHA256:cdfbf1d82de83f8fcf530d36c27943c1728292d1c5c5effbb1a5cea1fa0fac30" -> null
      - output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/ef/ef59cf17-31a3-4d66-854c-c4d606a938ac.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220209%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220209T105852Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=23a3daa3ee8b0dada0e76d2ccef759b867c7c61d632c8b5f4a6f0605ad835f2b" -> null
      - release_id        = "677fee5f-6a76-467a-b36e-18b60ee2bcca" -> null
      - slug_id           = "90ea55b9-32c5-4156-adee-93e053a66643" -> null
      - stack             = "heroku-20" -> null
      - status            = "succeeded" -> null
      - user              = [
          - {
              - email = "n13m4n0@gmail.com"
              - id    = "692ce5d5-b009-41f5-8e30-daa6b6ae9b7b"
            },
        ] -> null
      - uuid              = "ef59cf17-31a3-4d66-854c-c4d606a938ac" -> null

      - source {
          - path = "api" -> null
        }
    }

  # heroku_build.forager must be replaced
-/+ resource "heroku_build" "forager" {
      ~ id                = "5a206de5-409e-4f95-9316-a5c67b5547c6" -> (known after apply)
      ~ local_checksum    = "SHA256:6509a640165f881fd16bb9c6e77a91f49ab17675dc5fa5a2940a3b6474d96c65" -> "SHA256:993472ab11c975284ca66c93bb57ee42f9649359ae3f3ffc215e56bd6b43187b" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/92/9254653a-38b5-4a6e-9193-6ea0303f8fce/logs/5a/5a206de5-409e-4f95-9316-a5c67b5547c6.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20220209%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20220209T105852Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=b4d02e4a4cd91f9bb0e5ac2777519ad8aeedca3020dea0649d83fe3c05e4e8e6" -> (known after apply)
      ~ release_id        = "4cd3d1d2-5114-451c-b8dd-88f3e74f9073" -> (known after apply)
      ~ slug_id           = "954161fa-204d-4a5c-a841-afb4deddf587" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "n13m4n0@gmail.com"
              - id    = "692ce5d5-b009-41f5-8e30-daa6b6ae9b7b"
            },
        ] -> (known after apply)
      ~ uuid              = "5a206de5-409e-4f95-9316-a5c67b5547c6" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # heroku_build.gateway will be created
  + resource "heroku_build" "gateway" {
      + app               = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-go.git",
        ]
      + id                = (known after apply)
      + local_checksum    = "SHA256:2d9997b55a8f1aa3b2e913922dad2e3ebf6ea13faf97f7000cd0167c29231284"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "gateway"
        }
    }

  # heroku_build.recipe_one will be created
  + resource "heroku_build" "recipe_one" {
      + app               = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-go.git",
        ]
      + id                = (known after apply)
      + local_checksum    = "SHA256:381443e298c809c8c43243ff3b3996c056d0b1cfccee514d3fd3af47a58feae4"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "api"
        }
    }

  # heroku_build.user will be created
  + resource "heroku_build" "user" {
      + app               = (known after apply)
      + buildpacks        = [
          + "https://github.com/heroku/heroku-buildpack-go.git",
        ]
      + id                = (known after apply)
      + local_checksum    = "SHA256:2c4e42d360523425db9f55ce9e1b043242f41f6594787c323adf96c8ce70e851"
      + output_stream_url = (known after apply)
      + release_id        = (known after apply)
      + slug_id           = (known after apply)
      + stack             = (known after apply)
      + status            = (known after apply)
      + user              = (known after apply)
      + uuid              = (known after apply)

      + source {
          + checksum = (known after apply)
          + path     = "user"
        }
    }

  # heroku_formation.api will be destroyed
  # (because heroku_formation.api is not in configuration)
  - resource "heroku_formation" "api" {
      - app      = "adtest-recipe-app-api" -> null
      - id       = "4eed8fca-5954-455e-a770-5554e7e2664e" -> null
      - quantity = 1 -> null
      - size     = "Free" -> null
      - type     = "web" -> null
    }

  # heroku_formation.gateway will be created
  + resource "heroku_formation" "gateway" {
      + app      = (known after apply)
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

  # heroku_formation.recipe_one will be created
  + resource "heroku_formation" "recipe_one" {
      + app      = (known after apply)
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

  # heroku_formation.recipe_two will be created
  + resource "heroku_formation" "recipe_two" {
      + app      = (known after apply)
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

  # heroku_formation.user will be created
  + resource "heroku_formation" "user" {
      + app      = (known after apply)
      + id       = (known after apply)
      + quantity = 1
      + size     = "Free"
      + type     = "web"
    }

Plan: 18 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @noVerity, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Terraform`*